k6_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 005/200 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 005/200 VUs  0m00.9s/1m00.0s

running (0m02.0s), 010/200 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 010/200 VUs  0m01.9s/1m00.0s

running (0m03.0s), 015/200 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 015/200 VUs  0m02.9s/1m00.0s

running (0m04.0s), 020/200 VUs, 34 complete and 0 interrupted iterations
default   [   7% ] 020/200 VUs  0m03.9s/1m00.0s

running (0m05.0s), 025/200 VUs, 52 complete and 0 interrupted iterations
default   [   8% ] 025/200 VUs  0m04.9s/1m00.0s

running (0m06.0s), 030/200 VUs, 80 complete and 0 interrupted iterations
default   [  10% ] 030/200 VUs  0m05.9s/1m00.0s

running (0m07.0s), 035/200 VUs, 105 complete and 0 interrupted iterations
default   [  12% ] 035/200 VUs  0m06.9s/1m00.0s

running (0m08.0s), 039/200 VUs, 147 complete and 0 interrupted iterations
default   [  13% ] 039/200 VUs  0m07.9s/1m00.0s

running (0m09.0s), 044/200 VUs, 187 complete and 0 interrupted iterations
default   [  15% ] 044/200 VUs  0m08.9s/1m00.0s

running (0m10.0s), 049/200 VUs, 232 complete and 0 interrupted iterations
default   [  17% ] 049/200 VUs  0m09.9s/1m00.0s

running (0m11.0s), 053/200 VUs, 284 complete and 0 interrupted iterations
default   [  18% ] 053/200 VUs  0m10.9s/1m00.0s

running (0m12.0s), 057/200 VUs, 329 complete and 0 interrupted iterations
default   [  20% ] 057/200 VUs  0m11.9s/1m00.0s

running (0m13.0s), 061/200 VUs, 388 complete and 0 interrupted iterations
default   [  22% ] 061/200 VUs  0m12.9s/1m00.0s

running (0m14.0s), 064/200 VUs, 452 complete and 0 interrupted iterations
default   [  23% ] 064/200 VUs  0m13.9s/1m00.0s

running (0m15.0s), 068/200 VUs, 511 complete and 0 interrupted iterations
default   [  25% ] 068/200 VUs  0m14.9s/1m00.0s

running (0m16.0s), 072/200 VUs, 588 complete and 0 interrupted iterations
default   [  27% ] 072/200 VUs  0m15.9s/1m00.0s

running (0m17.0s), 076/200 VUs, 660 complete and 0 interrupted iterations
default   [  28% ] 076/200 VUs  0m16.9s/1m00.0s

running (0m18.0s), 079/200 VUs, 736 complete and 0 interrupted iterations
default   [  30% ] 079/200 VUs  0m17.9s/1m00.0s

running (0m19.0s), 083/200 VUs, 818 complete and 0 interrupted iterations
default   [  32% ] 083/200 VUs  0m18.9s/1m00.0s

running (0m20.0s), 087/200 VUs, 904 complete and 0 interrupted iterations
default   [  33% ] 087/200 VUs  0m20.0s/1m00.0s

running (0m21.0s), 091/200 VUs, 994 complete and 0 interrupted iterations
default   [  35% ] 091/200 VUs  0m20.9s/1m00.0s

running (0m22.0s), 094/200 VUs, 1100 complete and 0 interrupted iterations
default   [  37% ] 094/200 VUs  0m21.9s/1m00.0s

running (0m23.0s), 098/200 VUs, 1172 complete and 0 interrupted iterations
default   [  38% ] 098/200 VUs  0m22.9s/1m00.0s

running (0m24.0s), 102/200 VUs, 1281 complete and 0 interrupted iterations
default   [  40% ] 102/200 VUs  0m23.9s/1m00.0s

running (0m25.0s), 106/200 VUs, 1376 complete and 0 interrupted iterations
default   [  42% ] 106/200 VUs  0m24.9s/1m00.0s

running (0m26.0s), 109/200 VUs, 1483 complete and 0 interrupted iterations
default   [  43% ] 109/200 VUs  0m25.9s/1m00.0s

running (0m27.0s), 113/200 VUs, 1588 complete and 0 interrupted iterations
default   [  45% ] 113/200 VUs  0m26.9s/1m00.0s

running (0m28.0s), 117/200 VUs, 1693 complete and 0 interrupted iterations
default   [  47% ] 117/200 VUs  0m27.9s/1m00.0s

running (0m29.0s), 121/200 VUs, 1806 complete and 0 interrupted iterations
default   [  48% ] 121/200 VUs  0m28.9s/1m00.0s

running (0m30.0s), 124/200 VUs, 1913 complete and 0 interrupted iterations
default   [  50% ] 124/200 VUs  0m29.9s/1m00.0s

running (0m31.0s), 128/200 VUs, 2038 complete and 0 interrupted iterations
default   [  52% ] 128/200 VUs  0m30.9s/1m00.0s

running (0m32.0s), 132/200 VUs, 2172 complete and 0 interrupted iterations
default   [  53% ] 132/200 VUs  0m31.9s/1m00.0s

running (0m33.0s), 136/200 VUs, 2308 complete and 0 interrupted iterations
default   [  55% ] 136/200 VUs  0m32.9s/1m00.0s

running (0m34.0s), 139/200 VUs, 2446 complete and 0 interrupted iterations
default   [  57% ] 139/200 VUs  0m33.9s/1m00.0s

running (0m35.0s), 143/200 VUs, 2579 complete and 0 interrupted iterations
default   [  58% ] 143/200 VUs  0m34.9s/1m00.0s

running (0m36.0s), 147/200 VUs, 2722 complete and 0 interrupted iterations
default   [  60% ] 147/200 VUs  0m35.9s/1m00.0s

running (0m37.0s), 151/200 VUs, 2856 complete and 0 interrupted iterations
default   [  62% ] 151/200 VUs  0m36.9s/1m00.0s

running (0m38.0s), 154/200 VUs, 3002 complete and 0 interrupted iterations
default   [  63% ] 154/200 VUs  0m37.9s/1m00.0s

running (0m39.0s), 158/200 VUs, 3142 complete and 0 interrupted iterations
default   [  65% ] 158/200 VUs  0m38.9s/1m00.0s

running (0m40.0s), 162/200 VUs, 3306 complete and 0 interrupted iterations
default   [  67% ] 162/200 VUs  0m39.9s/1m00.0s

running (0m41.0s), 166/200 VUs, 3464 complete and 0 interrupted iterations
default   [  68% ] 166/200 VUs  0m40.9s/1m00.0s

running (0m42.0s), 169/200 VUs, 3618 complete and 0 interrupted iterations
default   [  70% ] 169/200 VUs  0m41.9s/1m00.0s

running (0m43.0s), 173/200 VUs, 3799 complete and 0 interrupted iterations
default   [  72% ] 173/200 VUs  0m43.0s/1m00.0s

running (0m44.0s), 177/200 VUs, 3973 complete and 0 interrupted iterations
default   [  73% ] 177/200 VUs  0m43.9s/1m00.0s

running (0m45.0s), 181/200 VUs, 4162 complete and 0 interrupted iterations
default   [  75% ] 181/200 VUs  0m44.9s/1m00.0s

running (0m46.0s), 184/200 VUs, 4328 complete and 0 interrupted iterations
default   [  77% ] 184/200 VUs  0m45.9s/1m00.0s

running (0m47.0s), 188/200 VUs, 4524 complete and 0 interrupted iterations
default   [  78% ] 188/200 VUs  0m46.9s/1m00.0s

running (0m48.0s), 192/200 VUs, 4713 complete and 0 interrupted iterations
default   [  80% ] 192/200 VUs  0m47.9s/1m00.0s

running (0m49.0s), 196/200 VUs, 4908 complete and 0 interrupted iterations
default   [  82% ] 196/200 VUs  0m48.9s/1m00.0s

running (0m50.0s), 199/200 VUs, 5100 complete and 0 interrupted iterations
default   [  83% ] 199/200 VUs  0m50.0s/1m00.0s

running (0m51.0s), 192/200 VUs, 5296 complete and 0 interrupted iterations
default   [  85% ] 192/200 VUs  0m50.9s/1m00.0s

running (0m52.0s), 170/200 VUs, 5480 complete and 0 interrupted iterations
default   [  87% ] 170/200 VUs  0m51.9s/1m00.0s

running (0m53.0s), 156/200 VUs, 5655 complete and 0 interrupted iterations
default   [  88% ] 156/200 VUs  0m52.9s/1m00.0s

running (0m54.0s), 134/200 VUs, 5787 complete and 0 interrupted iterations
default   [  90% ] 134/200 VUs  0m53.9s/1m00.0s

running (0m55.0s), 114/200 VUs, 5910 complete and 0 interrupted iterations
default   [  92% ] 114/200 VUs  0m54.9s/1m00.0s

running (0m56.0s), 094/200 VUs, 6016 complete and 0 interrupted iterations
default   [  93% ] 094/200 VUs  0m56.0s/1m00.0s

running (0m57.0s), 072/200 VUs, 6116 complete and 0 interrupted iterations
default   [  95% ] 072/200 VUs  0m56.9s/1m00.0s

running (0m58.0s), 054/200 VUs, 6184 complete and 0 interrupted iterations
default   [  97% ] 054/200 VUs  0m57.9s/1m00.0s

running (0m59.0s), 031/200 VUs, 6239 complete and 0 interrupted iterations
default   [  98% ] 031/200 VUs  0m58.9s/1m00.0s

running (1m00.0s), 018/200 VUs, 6261 complete and 0 interrupted iterations
default   [ 100% ] 018/200 VUs  0m59.9s/1m00.0s

running (1m01.0s), 002/200 VUs, 6277 complete and 0 interrupted iterations
default ↓ [ 100% ] 017/200 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<2000' p(95)=29.56ms

    http_req_failed
    ✓ 'rate<0.1' rate=0.00%

    job_creation_success
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......................: 18837   306.73508/s
    checks_succeeded...................: 100.00% 18837 out of 18837
    checks_failed......................: 0.00%   0 out of 18837

    ✓ job creation status is 201
    ✓ job creation has request_id
    ✓ job creation response time < 1000ms

    CUSTOM
    job_creation_success....................................................: 100.00% 6279 out of 6279
    response_time_ms........................................................: avg=12.455506 min=1.986  med=10.247  max=85.165  p(90)=23.2428 p(95)=29.5672

    HTTP
    http_req_duration.......................................................: avg=12.45ms   min=1.98ms med=10.24ms max=85.16ms p(90)=23.23ms p(95)=29.56ms
      { expected_response:true }............................................: avg=12.45ms   min=1.98ms med=10.24ms max=85.16ms p(90)=23.23ms p(95)=29.56ms
    http_req_failed.........................................................: 0.00%   0 out of 6280
    http_reqs...............................................................: 6280    102.26131/s

    EXECUTION
    iteration_duration......................................................: avg=1.01s     min=4.75ms med=1.01s   max=2.03s   p(90)=1.8s    p(95)=1.91s  
    iterations..............................................................: 6279    102.245027/s
    vus.....................................................................: 2       min=2            max=199
    vus_max.................................................................: 200     min=200          max=200

    NETWORK
    data_received...........................................................: 1.1 MB  19 kB/s
    data_sent...............................................................: 1.6 MB  25 kB/s



running (1m01.4s), 000/200 VUs, 6279 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m0s